tap "jandedobbeleer/oh-my-posh"
brew "fmt"
brew "bat"
brew "biome"
brew "boost"
brew "btop"
brew "cmake"
brew "cocoapods"
brew "docker"
brew "eza"
brew "fd"
brew "fswatch"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git-delta"
brew "go"
brew "golangci-lint"
brew "helm"
brew "imagemagick"
brew "kind"
brew "lazygit"
brew "neovim"
brew "openvpn"
brew "pnpm"
brew "tldr"
brew "yazi"
brew "zig"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
cask "codex"
cask "ghostty"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "anthropic.claude-code"
vscode "biomejs.biome"
vscode "blazejkustra.react-compiler-marker"
vscode "bradlc.vscode-tailwindcss"
vscode "coderabbit.coderabbit-vscode"
vscode "continue.continue"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-postgresql-client2"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "divyanshuagrawal.competitive-programming-helper"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "feziro.image-to-base64"
vscode "figma.figma-vscode-extension"
vscode "forkyou.forkyou"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.docker-explorer"
vscode "formulahendry.docker-extension-pack"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "hediet.debug-visualizer"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mechatroner.rainbow-csv"
vscode "meta.pyrefly"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "postman.postman-for-vscode"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "redis.redis-for-vscode"
vscode "s2junn.image-essentials"
vscode "shahilkumar.docxreader"
vscode "shyykoserhiy.vscode-spotify"
vscode "sonarsource.sonarlint-vscode"
vscode "stivo.tailwind-fold"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wallabyjs.console-ninja"
vscode "wallabyjs.quokka-vscode"
vscode "wallabyjs.wallaby-vscode"
vscode "yoavbls.pretty-ts-errors"
go "golang.org/x/tools/gopls"
go "github.com/securego/gosec/v2/cmd/gosec"
go "golang.org/x/vuln/cmd/govulncheck"
go "honnef.co/go/tools/cmd/staticcheck"
