tap "jandedobbeleer/oh-my-posh"
tap "steipete/tap"
brew "bat"
brew "biome"
brew "blueutil"
brew "btop"
brew "coreutils"
brew "direnv"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "gifsicle"
brew "git-delta"
brew "git-lfs"
brew "go"
brew "imagemagick"
brew "just"
brew "kubernetes-cli"
brew "lazygit"
brew "neovim"
brew "openvpn"
brew "pnpm"
brew "poppler"
brew "restic"
brew "sshpass"
brew "switchaudio-osx"
brew "tldr"
brew "uv"
brew "wget"
brew "yazi"
brew "yt-dlp"
brew "zbar"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "steipete/tap/gogcli"
cask "blackhole-2ch"
cask "codex"
cask "gcloud-cli"
cask "ghostty"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "anthropic.claude-code"
vscode "biomejs.biome"
vscode "blazejkustra.react-compiler-marker"
vscode "bradlc.vscode-tailwindcss"
vscode "coderabbit.coderabbit-vscode"
vscode "continue.continue"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-postgresql-client2"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "feziro.image-to-base64"
vscode "figma.figma-vscode-extension"
vscode "forkyou.forkyou"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.docker-explorer"
vscode "formulahendry.docker-extension-pack"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "hediet.debug-visualizer"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mechatroner.rainbow-csv"
vscode "meta.pyrefly"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "postman.postman-for-vscode"
vscode "redhat.vscode-yaml"
vscode "redis.redis-for-vscode"
vscode "s2junn.image-essentials"
vscode "shahilkumar.docxreader"
vscode "shyykoserhiy.vscode-spotify"
vscode "sonarsource.sonarlint-vscode"
vscode "stivo.tailwind-fold"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "visualstudiotoolsforunity.vstuc"
vscode "wallabyjs.console-ninja"
vscode "wallabyjs.quokka-vscode"
vscode "wallabyjs.wallaby-vscode"
vscode "yoavbls.pretty-ts-errors"
go "golang.org/x/tools/gopls"
go "github.com/securego/gosec/v2/cmd/gosec"
go "golang.org/x/vuln/cmd/govulncheck"
go "honnef.co/go/tools/cmd/staticcheck"
uv "nano-pdf"
